app/controllers/bulkcharges_controller.rb

SELECT "bulk_charges".* FROM "bulk_charges" WHERE "bulk_charges"."id" = 8 LIMIT 1
---
  def csv_preview
    @bulk_charge = BulkCharge.find(params[:id])