app/controllers/bulkcharges_controller.rb

SELECT "bulk_charges".* FROM "bulk_charges" ORDER BY "bulk_charges"."created_at" DESC
---
  def index
    @bulk_charges = BulkCharge.all.order(created_at: :desc)

INSERT INTO "bulk_charges" ("status", "created_at", "updated_at") VALUES (0, '2025-07-25 08:36:35.251613', '2025-07-25 08:36:35.251613') RETURNING "id"
---
  def create
  @bulk_charge = BulkCharge.new(bulk_charge_params)
  @bulk_charge.status = :pending

  if @bulk_charge.save

SELECT "bulk_charges".* FROM "bulk_charges" WHERE "bulk_charges"."id" = 8 LIMIT 1
---
  def show
    @bulk_charge = BulkCharge.find(params[:id])