app/jobs/charge_csv_job.rb

  def perform(bulk_charge_id)
    p "Starting ChargeCsvJob for BulkCharge ID: #{bulk_charge_id}"
    bulk_charge = BulkCharge.find(bulk_charge_id)
    return unless bulk_charge
    bulk_charge.update!(status: :in_progress)
    csv_text = bulk_charge.csv_file.download
    p "CSV file downloaded for BulkCharge ID: #{bulk_charge_id}, content length: #{csv_text.length} characters"
    CSV.parse(csv_text, headers: true).each.with_index(1) do |row, index|
      process_row(bulk_charge, row, index)
    end
    bulk_charge.update!(status: :completed)
  rescue StandardError => e
    bulk_charge&.update!(status: :failed)
---
SELECT "bulk_charges".* FROM "bulk_charges" WHERE "bulk_charges"."id" = 50 LIMIT 1
UPDATE "bulk_charges" SET "status" = 1, "updated_at" = '2025-07-29 13:39:38.956828' WHERE "bulk_charges"."id" = 50
UPDATE "bulk_charges" SET "status" = 3, "updated_at" = '2025-07-25 17:12:12.125691' WHERE "bulk_charges"."id" = 21
UPDATE "bulk_charges" SET "status" = 3, "updated_at" = '2025-07-29 13:39:41.988394' WHERE "bulk_charges"."id" = 50